In [2]:
'''
Challenge link
https://preppindata.blogspot.com/2023/02/2023-week-7-flagging-fraudulent.html
'''

import pandas as pd

In [3]:
trans_path = pd.read_csv("Transaction Path.csv")
trans_details = pd.read_csv("Transaction Detail.csv")
acc_holders = pd.read_csv("Account Holders.csv")
acc_info = pd.read_csv('Account Information.csv')

In [4]:
trans_path.info()
trans_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8781 entries, 0 to 8780
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  8781 non-null   int64
 1   Account_To      8781 non-null   int64
 2   Account_From    8781 non-null   int64
dtypes: int64(3)
memory usage: 205.9 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8781 entries, 0 to 8780
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8781 non-null   int64
 1   Transaction Date  8781 non-null   object
 2   Value             8781 non-null   float64
 3   Cancelled?        8781 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 274.5+ KB

In [5]:
acc_holders.info()
acc_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3072 entries, 0 to 3071
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Holder ID      3072 non-null   int64
 1   Name                   3072 non-null   object
 2   Date of Birth          3072 non-null   object
 3   Contact Number         3072 non-null   int64
 4   First Line of Address  3072 non-null   object
dtypes: int64(2), object(3)
memory usage: 120.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Account Number     3000 non-null   int64
 1   Account Type       3000 non-null   object
 2   Account Holder ID  3000 non-null   object
 3   Balance Date       3000 non-null   object
 4   Balance            3000 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 117.3+ KB

### For the Transaction Path table Make sure field naming convention matches the other tables

In [6]:
trans_path.rename(columns={'Account_To': 'Account To', 'Account_From' : 'Account From' }, inplace = True)
trans_path.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8781 entries, 0 to 8780
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  8781 non-null   int64
 1   Account To      8781 non-null   int64
 2   Account From    8781 non-null   int64
dtypes: int64(3)
memory usage: 205.9 KB

### For the Account Information table:
    * Make sure there are no null values in the Account Holder ID
    * Ensure there is one row per Account Holder ID
        * Joint accounts will have 2 Account Holders, we want a row for each of them

In [7]:
acc_info.groupby('Account Type').count()

              Account Number  Account Holder ID  Balance Date  Balance
Account Type
Basic                   1199               1199          1199     1199
Gold                    1274               1274          1274     1274
Joint                     72                 72            72       72
Platinum                 455                455           455      455

In [8]:
acc_info.head(5)
l = len(acc_info)
for i in range(l):
    if acc_info.loc[i,'Account Type'] == 'Joint':
        x = acc_info.loc[i, 'Account Holder ID']
        x = x.split(', ')
        acc_info.loc[i, 'Account Holder ID'] = x[0]
        y = acc_info.loc[i].tolist()
        y[2] = x[1]
        acc_info.loc[len(acc_info)] = y
acc_info.groupby('Account Type').count()

              Account Number  Account Holder ID  Balance Date  Balance
Account Type
Basic                   1199               1199          1199     1199
Gold                    1274               1274          1274     1274
Joint                    144                144           144      144
Platinum                 455                455           455      455

In [9]:
temp = acc_info.loc[acc_info['Account Type'] == 'Joint']
temp.iloc[0] , temp.iloc[72]

(Account Number         10034341
 Account Type              Joint
 Account Holder ID      89920386
 Balance Date         2023-01-31
 Balance                  390.39
 Name: 4, dtype: object,
 Account Number         10034341
 Account Type              Joint
 Account Holder ID      97325900
 Balance Date         2023-01-31
 Balance                  390.39
 Name: 3000, dtype: object)

In [10]:
acc_info.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3072 entries, 0 to 3071
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Account Number     3072 non-null   int64
 1   Account Type       3072 non-null   object
 2   Account Holder ID  3072 non-null   object
 3   Balance Date       3072 non-null   object
 4   Balance            3072 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 144.0+ KB

### For the Account Holders table:
        Make sure the phone numbers start with 07

In [11]:
acc_holders.head(5)

,Account Holder ID,Name,Date of Birth,Contact Number,First Line of Address
0,70390615,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park
1,20123998,Maynord Surgeoner,21/08/1997,7716107305,6422 Buena Vista Plaza
2,54374080,Giraldo Kimbley,22/03/1995,7489940612,93005 Summer Ridge Avenue
3,97027297,Blake Dudson,30/06/1955,7253587445,2 Huxley Hill
4,89920386,Ajay Douce,19/12/1930,7395580534,90176 Miller Alley

In [12]:
z = '0'
acc_holders['Contact Number'] = [z+str(x) for x in acc_holders['Contact Number']] 
acc_holders.head(5)

,Account Holder ID,Name,Date of Birth,Contact Number,First Line of Address
0,70390615,Mahmoud Hehnke,28/08/1995,07479286250,18535 Loftsgordon Park
1,20123998,Maynord Surgeoner,21/08/1997,07716107305,6422 Buena Vista Plaza
2,54374080,Giraldo Kimbley,22/03/1995,07489940612,93005 Summer Ridge Avenue
3,97027297,Blake Dudson,30/06/1955,07253587445,2 Huxley Hill
4,89920386,Ajay Douce,19/12/1930,07395580534,90176 Miller Alley

# Bring the tables together

In [13]:
trans_details.info()
trans_path.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8781 entries, 0 to 8780
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8781 non-null   int64
 1   Transaction Date  8781 non-null   object
 2   Value             8781 non-null   float64
 3   Cancelled?        8781 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 274.5+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8781 entries, 0 to 8780
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  8781 non-null   int64
 1   Account To      8781 non-null   int64
 2   Account From    8781 non-null   int64
dtypes: int64(3)
memory usage: 205.9 KB

In [14]:
trans_df = trans_path.merge(trans_details, how='left', on='Transaction ID')
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8781 entries, 0 to 8780
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8781 non-null   int64
 1   Account To        8781 non-null   int64
 2   Account From      8781 non-null   int64
 3   Transaction Date  8781 non-null   object
 4   Value             8781 non-null   float64
 5   Cancelled?        8781 non-null   object
dtypes: float64(1), int64(3), object(2)
memory usage: 480.2+ KB

In [15]:
acc_holders.info()
acc_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3072 entries, 0 to 3071
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Holder ID      3072 non-null   int64
 1   Name                   3072 non-null   object
 2   Date of Birth          3072 non-null   object
 3   Contact Number         3072 non-null   object
 4   First Line of Address  3072 non-null   object
dtypes: int64(1), object(4)
memory usage: 120.1+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 3072 entries, 0 to 3071
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Account Number     3072 non-null   int64
 1   Account Type       3072 non-null   object
 2   Account Holder ID  3072 non-null   object
 3   Balance Date       3072 non-null   object
 4   Balance            3072 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 144.0+ KB

In [16]:
acc_info['Account Holder ID'] = acc_info['Account Holder ID'].astype(int)

In [17]:
acc_df = acc_info.merge(acc_holders, how='left', on='Account Holder ID')
acc_df.info(),trans_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3072 entries, 0 to 3071
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Number         3072 non-null   int64
 1   Account Type           3072 non-null   object
 2   Account Holder ID      3072 non-null   int32
 3   Balance Date           3072 non-null   object
 4   Balance                3072 non-null   float64
 5   Name                   3072 non-null   object
 6   Date of Birth          3072 non-null   object
 7   Contact Number         3072 non-null   object
 8   First Line of Address  3072 non-null   object
dtypes: float64(1), int32(1), int64(1), object(6)
memory usage: 228.0+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 8781 entries, 0 to 8780
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8781 non-null   int64
 1   Account To        8781 non-null   int64
 2   Account From      8781 non-null   int64
 3   Transaction Date  8781 non-null   object
 4   Value             8781 non-null   float64
 5   Cancelled?        8781 non-null   object
dtypes: float64(1), int64(3), object(2)
memory usage: 480.2+ KB

(None, None)

In [18]:
trans_df.rename(columns={'Account From': 'Account Number'}, inplace=True)
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8781 entries, 0 to 8780
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8781 non-null   int64
 1   Account To        8781 non-null   int64
 2   Account Number    8781 non-null   int64
 3   Transaction Date  8781 non-null   object
 4   Value             8781 non-null   float64
 5   Cancelled?        8781 non-null   object
dtypes: float64(1), int64(3), object(2)
memory usage: 480.2+ KB

In [19]:
total_df = acc_df.merge(trans_df, how='left', on='Account Number')
total_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9152 entries, 0 to 9151
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Number         9152 non-null   int64
 1   Account Type           9152 non-null   object
 2   Account Holder ID      9152 non-null   int32
 3   Balance Date           9152 non-null   object
 4   Balance                9152 non-null   float64
 5   Name                   9152 non-null   object
 6   Date of Birth          9152 non-null   object
 7   Contact Number         9152 non-null   object
 8   First Line of Address  9152 non-null   object
 9   Transaction ID         8975 non-null   float64
 10  Account To             8975 non-null   float64
 11  Transaction Date       8975 non-null   object
 12  Value                  8975 non-null   float64
 13  Cancelled?             8975 non-null   object
dtypes: float64(4), int32(1), int64(1), object(8)
memory usage: 1.0+ MB

### Filter out cancelled transactions

In [20]:
total_df.groupby('Cancelled?').count()

,Account Number,Account Type,Account Holder ID,Balance Date,Balance,Name,Date of Birth,Contact Number,First Line of Address,Transaction ID,Account To,Transaction Date,Value
Cancelled?,,,,,,,,,,,,,
N,8879,8879,8879,8879,8879,8879,8879,8879,8879,8879,8879,8879,8879
Y,96,96,96,96,96,96,96,96,96,96,96,96,96

In [21]:
total_df = total_df[total_df['Cancelled?'] != 'Y']
total_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9056 entries, 0 to 9151
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Number         9056 non-null   int64
 1   Account Type           9056 non-null   object
 2   Account Holder ID      9056 non-null   int32
 3   Balance Date           9056 non-null   object
 4   Balance                9056 non-null   float64
 5   Name                   9056 non-null   object
 6   Date of Birth          9056 non-null   object
 7   Contact Number         9056 non-null   object
 8   First Line of Address  9056 non-null   object
 9   Transaction ID         8879 non-null   float64
 10  Account To             8879 non-null   float64
 11  Transaction Date       8879 non-null   object
 12  Value                  8879 non-null   float64
 13  Cancelled?             8879 non-null   object
dtypes: float64(4), int32(1), int64(1), object(8)
memory usage: 1.0+ MB

In [22]:
total_df.head(5)

,Account Number,Account Type,Account Holder ID,Balance Date,Balance,Name,Date of Birth,Contact Number,First Line of Address,Transaction ID,Account To,Transaction Date,Value,Cancelled?
0,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,07479286250,18535 Loftsgordon Park,1.711865e+09,43772330.0,2023-02-08,65.49,N
1,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,07479286250,18535 Loftsgordon Park,1.753187e+09,65199307.0,2023-02-02,1097.60,N
2,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,07479286250,18535 Loftsgordon Park,3.011216e+09,44427272.0,2023-02-05,108.26,N
3,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,07479286250,18535 Loftsgordon Park,8.072095e+09,34681193.0,2023-02-04,67.01,N
4,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,07479286250,18535 Loftsgordon Park,9.755066e+09,39620163.0,2023-02-10,27.61,N

### Filter to transactions greater than Â£1,000 in value

In [23]:
filtered_df = total_df[total_df['Value'] > 1000]
filtered_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 565 entries, 1 to 9098
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Number         565 non-null    int64
 1   Account Type           565 non-null    object
 2   Account Holder ID      565 non-null    int32
 3   Balance Date           565 non-null    object
 4   Balance                565 non-null    float64
 5   Name                   565 non-null    object
 6   Date of Birth          565 non-null    object
 7   Contact Number         565 non-null    object
 8   First Line of Address  565 non-null    object
 9   Transaction ID         565 non-null    float64
 10  Account To             565 non-null    float64
 11  Transaction Date       565 non-null    object
 12  Value                  565 non-null    float64
 13  Cancelled?             565 non-null    object
dtypes: float64(4), int32(1), int64(1), object(8)
memory usage: 64.0+ KB

### Filter out Platinum accounts

In [24]:
filtered_df = filtered_df[filtered_df['Account Type'] != 'Platinum']
filtered_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 476 entries, 30 to 9098
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Number         476 non-null    int64
 1   Account Type           476 non-null    object
 2   Account Holder ID      476 non-null    int32
 3   Balance Date           476 non-null    object
 4   Balance                476 non-null    float64
 5   Name                   476 non-null    object
 6   Date of Birth          476 non-null    object
 7   Contact Number         476 non-null    object
 8   First Line of Address  476 non-null    object
 9   Transaction ID         476 non-null    float64
 10  Account To             476 non-null    float64
 11  Transaction Date       476 non-null    object
 12  Value                  476 non-null    float64
 13  Cancelled?             476 non-null    object
dtypes: float64(4), int32(1), int64(1), object(8)
memory usage: 53.9+ KB

In [25]:
filtered_df.to_csv('output.csv', index=False)